[Killed] BlockStatement
scripts/MyScript.js:2:23
 // mathUtils.js
-function factorial(n) {
-    if (/*typeof n !== 'number' || */!Number.isInteger(n) || n < 0) {
-      throw new Error('Invalid argument. Non-negative integer expected.');
-    }
-
-  
-    let result = 1;
-    for (let i = 2; i <= n; i++) {
-      result *= i;
-    }
-  
-    return result;
-  }
+function factorial(n) {}
   
   module.exports = {
killedBy: Invalid (string)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid argument. Non-negative integer expected."

Received function did not throw

[Killed] ConditionalExpression
scripts/MyScript.js:3:62
 // mathUtils.js
 function factorial(n) {
-    if (/*typeof n !== 'number' || */!Number.isInteger(n) || n < 0) {
+    if (/*typeof n !== 'number' || */!Number.isInteger(n) || false) {
       throw new Error('Invalid argument. Non-negative integer expected.');
     }
killedBy: Invalid (int, < 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid argument. Non-negative integer expected."

Received function did not throw

[Killed] BlockStatement
scripts/MyScript.js:3:69
 // mathUtils.js
 function factorial(n) {
-    if (/*typeof n !== 'number' || */!Number.isInteger(n) || n < 0) {
-      throw new Error('Invalid argument. Non-negative integer expected.');
-    }
+    if (/*typeof n !== 'number' || */!Number.isInteger(n) || n < 0) {}
 
   
killedBy: Invalid (string)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid argument. Non-negative integer expected."

Received function did not throw

[Killed] ConditionalExpression
scripts/MyScript.js:9:21
 
   
     let result = 1;
-    for (let i = 2; i <= n; i++) {
+    for (let i = 2; false; i++) {
       result *= i;
     }
killedBy: Result 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] EqualityOperator
scripts/MyScript.js:9:21
 
   
     let result = 1;
-    for (let i = 2; i <= n; i++) {
+    for (let i = 2; i < n; i++) {
       result *= i;
     }
killedBy: Result 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 2

[Killed] AssignmentOperator
scripts/MyScript.js:10:7
   
     let result = 1;
     for (let i = 2; i <= n; i++) {
-      result *= i;
+      result /= i;
     }
   
killedBy: Result 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0.16666666666666666

[Killed] ObjectLiteral
scripts/MyScript.js:16:20
     return result;
   }
   
-  module.exports = {
-    factorial
-  };
+  module.exports = {};
   
killedBy: Invalid (string)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid argument. Non-negative integer expected."
Received message:   "factorial is not a function"

      21 | test('Invalid (string)', () => {
      22 |     expect(() => {
    > 23 |         factorial("a");
